import Logo from "../../assets/msp.png";

const AboutMain = () => {
  return (
    <>
      <div className="bg-red-900 w-full h-auto flex flex-col justify-center items-center pt-32 pb-16 gap-y-10">
        <h1 className="text-[29px] sm:text-[40px] lg:text-[50px] xl:text-[70px] text-amber-500 font-bold text-center">
          மக்கள் சிந்தனைப் பேரவை
        </h1>
        <div className="w-[90vw] md:w-[600px] lg:w-[1000px] xl:w-[1200px] flex flex-col lg:flex-row justify-between items-center lg:items-start gap-x-14">
          {/* Image */}
          <div className="w-full max-w-[300px] sm:min-w-[310px] bg-white rounded-2xl flex justify-center items-center p-7">
            <img
              src={"https://i.ibb.co/pRn6QQ0/msp.png"}
              className="w-full object-cover"
              alt="MSP Logo"
            />
          </div>
          <p className="text-justify text-white text-opacity-80 font-medium text-[12px] sm:text-[13px] md:text-[14px] lg:text-[15px] xl:text-[16px] mt-12 lg:mt-0">
            1998 இல் ஈரோடு நகரில் தோற்றுவிக்கப்பட்ட பொதுநல அமைப்பு.
            தொடங்கப்பட்டவுடன் நேரடியாக நிகழ்வுகள் நடத்தப்பட்டன. அந்நிகழ்வுகளில்
            ஆர்வமுடன் பங்கேற்றோரை கண்டறிந்து அவர்களை உறுப்பினர்களாக்கி
            படிப்படியாக ஏடு அமைப்பை வடிவத்திற்கு இட்டுச் செல்லப்பட்டது. பாரதி
            விழா, அரசு பள்ளி ஆசிரியர்களுக்கு பாராட்டு விழா, உள்ளிட்ட நிகழ்வுகள்
            நடத்தப்பட்டன. 2005 இல் இருந்து ஆண்டுதோறும் ஆகஸ்ட் மாதத்தில் 12
            நாட்களுக்கு 'ஈரோடு புத்தகத் திருவிழா' பேரவையால் நடத்தப்பட்டது.
            ஆண்டுதோறும் பெப்ரவரி 28ஆம் தேதி 'தேசிய அறிவியல் தினம்'
            நடத்தப்படுகிறது கருத்தரங்குகள், நூல் வெளியீடுகள், பயிலரங்குகள்,
            பயிற்சி பட்டறைகள், மாநாடுகள் என்று பல வடிவங்களில் நிகழ்வுகள்
            நடத்தப்பட்டன. புயல், வெள்ளம், இயற்கை பேரிடர் காலங்களில் பேரவையின்
            நூற்றுக்கணக்கான தன்னார்வத் தொண்டர்களுடன் பேரவை தலைமை களத்தில் இறங்கி
            நிவாரணப் பணிகளில் ஈடுபட்டது. இவ்வாறு கடந்த 26 ஆண்டுகளாக இடையிடாது
            வளர்ச்சி பெற்று ஏழு அமைப்பாக உருவெடுத்து தற்போது மாநிலத் தழுவிய
            அமைப்பாக விரிவடைந்துள்ளது. நூறாண்டுக்கு முன்பு ஜப்பான் நாட்டிலும்
            பேரவையின் கிளை தொடங்கப்பட்டு சிறப்பாக செயல்பட்டு வருகிறது. ஈரோடு
            பேரவையின் தலைமையகம் பேரவைக்கு என்று தனி அலுவலகம் உள்ளது.
            ஆயிரக்கணக்கில் உறுப்பினர்கள் உள்ளனர். இது ஏடு சாதி, மத, அரசியல்
            கட்சி சார்பில்லாத அமைப்பு.
          </p>
        </div>
      </div>
    </>
  );
};

export default AboutMain;
