const Jothi = ({ snapAlign = "start" }) => {
  return (
    <div
      style={{ scrollSnapAlign: snapAlign }}
      className="w-full max-w-[1200px] mx-auto h-auto pt-20 md:pt-10 px-5 sm:px-10 lg:pt-36 flex justify-center items-center"
    >
      <div className="w-full bg-gray-100 rounded-xl flex flex-col lg:flex-row justify-between items-center gap-y-10 lg:gap-x-10 lg:gap-y-0 px-5 sm:px-10 lg:px-16 py-8">
        {/* Image */}
        <img
          src={"https://i.ibb.co/PzHWPjN/gettyimages-117246139-612x612.jpg"}
          className="w-full max-w-[300px] sm:max-w-[250px] rounded-xl object-cover"
          alt="Jothi"
        />

        {/* Text Content */}
        <div className="w-full h-auto">
          <h1 className="text-[32px] sm:text-[40px] lg:text-[50px] text-red-900 font-bold mb-5 text-center lg:text-left">
            பாரதி ஜோதி
          </h1>
          <p className="text-[14px] sm:text-[16px] font-medium leading-relaxed text-justify lg:text-left">
            மகாகவி பாரதி 1921 ஆம் ஆண்டு ஈரோடு கருங்கல்பாளையத்திலுள்ள
            வாசகசாலையின் ஐந்தாம் ஆண்டு விழாவில் பங்கேற்று மனிதனுக்கு மரணமில்லை
            என்ற தலைப்பில் சொற்பொழிவாற்றியுள்ளார் இதுவே பாரதி நிகழ்த்திய இறுதிப்
            பேருரையாகும் பாரதியின் ஈரோடு வருகையை மக்களுக்கு வெளிப்படுத்தும்
            விதத்திலும், அவரது உரையை நினைவூட்டும் வகையிலும் ஆண்டுதோறும் ஈரோடு
            மாநகரில் மக்கள் சிந்தனைப் பேரவையின் சார்பில் நடத்தப்படும் பாரதி
            விழாவையொட்டி பாரதி உரையாற்றிய வாசகசாலையிலிருந்து பாரதி விழா
            நடைபெறும் கொங்கு கலையரங்கம் வரை மக்கள் சிந்தனைப் பேரவையின் மாணவர்
            படையினர் நூறு பேர் பேரவையின் சீருடையுடன் அணிவகுத்து நகரை வலம் வருவர்
            அணிவகுப்பின் முன்பு இளைஞர்கள் எழுப்பும் இசை முழக்கத்துடன் ஒரு மாணவர்
            பாரதி ஜோதி' ஏந்தி கம்பீரமாக நடந்து வருவார். இந்த ஜோதி பாரதி விழா
            அரங்கின் முன்பாக வரவேற்கப்பட்டு பாரதி விருது பெறும் ஆளுமையின்
            கரங்களில் ஒப்படைக்கப்படுகிறது விருதாளர் சுமார் நூறடி தூரம் ஜோதி
            ஏந்தி நடந்து சென்று மேடைக்கு முன்பாக வைக்கப்பட்டுள்ள பாரதி படத்தின்
            முன்பு மண்ணில் நட்டு வைப்பார் ஜோதி - நிகழ்ச்சி முடியும் வரை
            ஜெகஜோதியாகப் பிரகாசித்து எரிந்து கொண்டிருக்கும். முன்னதாக ஜோதி வரும்
            வழி நெடுக பாரதியே ஜோதி வடிவில் அணிவகுப்பை வழி நடத்தி வருவது போல்
            மக்கள் உணர்ந்து பரவசத்தோடு கண்டுகளிப்பர் இந்நிகழ்வு ஆண்டுதோறும்
            ஈரோட்டில் நடைபெறும் 'பாரதி விழா'விற்கு உயிரூட்டுவதாக அமைகிறது
          </p>
        </div>
      </div>
    </div>
  );
};

export default Jothi;
